# EMA 衰减率
beta = 0.1

# 标准化指数常量和底
log_c = 1
log_d = 10

# 专家打分权重：每个专家打一次分
expert_weights = [
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家1
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家2
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家3
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家4
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家5
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家6
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家7
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家8
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家9
    {'检验成本': 0.25, '不合格率': 0.25, '返工成本': 0.25, '报废成本': 0.25},  # 专家10
]

# 权重融合比例
expert_weights_percent = 0.5

# 数据分级阈值
CV_High = 0.5
CV_Low = 0.25

# 文件路径配置
excel_save_path = "./result/test_result.xlsx"

# 班次映射（shift_name）
shift_name_map = {
    "1357edf62c9b90e7388cd124a9ba32e3": "夜班",
    "32ff2a5dfec8fd310bdb199f8200612b": "白班",
    "7ebdc8830da02395efcf501f4f24a9f3": "中班"
}

# 线体区域映射（line_area_name）
line_area_map = {
    "1764e8b5c5a011eaaf8c00ff42a0ab59": "Line 1",
    "1854759913403961346": "非生产线",
    "2f7da54dc5a011eaaf8c00ff42a0ab59": "Line 2",
    "3235f113c5a111eaaf8c00ff42a0ab59": "Line 3",
    "40263be0c5a111eaaf8c00ff42a0ab59": "Line 4",
    "533addafc5a111eaaf8c00ff42a0ab59": "Line 5",
    "6db15700c5a111eaaf8c00ff42a0ab59": "Paint",
    "7a38136ac5a111eaaf8c00ff42a0ab59": "Roller",
    "8plkoi98c5a111eaaf8c00ff42a0ab59": "Big Roller"
}

# 产线工位映射（station_name）
station_name_map = {
    "1854759979862708225": "CMT",
    "1854760054198358018": "IQA",
    "1859592902697967617": "FQG",
    "1930174862997835777": "L2 对刀室",
    "1ca6c054e5c1a3c7cb325e38e24b2c68": "Link Mazak",
    "6204ab88cc226b40b5fc240cbf7124e8": "Bushing热处理",
    "6ee0a8042b454020433de2cd8b852a43": "小轮装配",
    "9b656760962ab5c1a0efbb8e1844ac0a": "履带涂漆工位",
    "a80177271af3db6162bbb93680d2af2d": "Pin热处理",
    "affb86b150fd1e6a179f66576d44caf8": "Link热处理",
    "ce2074081796ff60b7619955df0f109c": "履带装配",
    "d4830753904f0864995c546e05fd8da0": "大轮装配",
    "fdd23910b91ac183175b4796ff747e82": "Link机加工"
}

#  结果映射（process_result_id）
process_result_map = {
    "1509825125711699969": "返工",
    "1510533420399206402": "退回供应商",
    "1511720363917131778": "正常接收",
    "1511720392635531266": "偏差",
    "1511720419797843970": "重新分类（拆卸后零件部件重新使用）",
    "1511720445450207234": "报废",
    "1511720480694943745": "挑选",
    "1511720514522005506": "待返工",
    "1552469840551415810": "物料无随行单",
    "1678220882022215682": "外协除锈",
    "1678916673720266754": "供应商在线返工"
}

station_map = {
    "Big Roller 大轮装配":  1,
    "Line 1 Link热处理":    2,
    "Line 1 履带装配":      3,
    "Line 2 Bushing热处理": 4,
    "Line 2 Link机加工":    5,
    "Line 2 Link热处理":    6,
    "Line 2 Pin热处理":     7,
    "Line 2 履带装配":      8,
    "Line 3 Bushing热处理": 9,
    "Line 3 Link机加工":    10,
    "Line 3 Link热处理":    11,
    "Line 3 Pin热处理":     12,
    "Line 3 履带装配":      13,
    "Line 4 Bushing热处理": 14,
    "Line 4 Link机加工":    15,
    "Line 4 Link热处理":    16,
    "Line 4 Pin热处理":     17,
    "Line 4 履带装配":      18,
    "Line 5 Bushing热处理": 19,
    "Line 5 Link Mazak":   20,
    "Line 5 Link机加工":    21,
    "Line 5 Link热处理":    22,
    "Line 5 Pin热处理":     23,
    "Line 5 履带装配":      24,
    "Paint 履带涂漆工位":   25,
    "Roller 小轮装配":      26,
}